/*
    Задача:

        Напишите шаблонный класс пары объектов - Pair, который сможет хранить в себе 2 объекта произвольных типов.
        В этом классе должно быть 2 публичных поля: first и second.
        В поле first должен храниться первый объект, а в поле second - второй.

        Напишите консруктор для этого класса от двух аргументов.
        Также определите для этого класса операторы сравнения. Операторы сравнения должны работать лексикографически.
        То есть сначала сравнивается первые элементы. Если они равны, то сравниваются вторые.

*/

#include <iostream>


int main()
{

}