#include <iostream>
#include <string>
using std::cout, std::endl;


/*
    Задача:

        Напищите программу, которая будет считывать слова (используйте std::cin) в бесконечном цикле и каждый
        раз печатать сумму всех слов. Например, если пользователь ввёл Hello, то программа должна напечатать
        Hello и запросить следующее слово. Если затем пользователь введёт World, то программа должна будет
        напечатать HelloWorld и запросить следуещее слово и так далее.
        Программа должна останавливаться если пользователь ввёл слово "quit".

        Для хранения строки используйте класс std::string
*/


int main()
{

}