#include <cstdio>

int main()
{
	printf("Hello World++\n");
}

// Задание:
// Скомпилировать и запустить