#include <cstdio>

/*
	Большинство программ на C можно скомпировать и с помощью компилятора C++
	Для подключения библиотек языка C в C++ желательно использовать
	изменённые названия:

 	С               С++
	stdio.h   -->   cstdio         (т. е. stdio из C)
	stdlib.h  -->   cstdlib
*/


int main() 
{
	printf("Hello World++\n");
}

// Задание:
// Скомпилировать и запустить с помощью компилятора g++