#include <stdio.h>

int main()
{
    float a, b;
    scanf("%f%f", &a, &b);

    printf("%f\n", a + b);
}

/*
    Задача:

        Напишите программу, которая будет считывать 2 числа типа float, вычислять их сумму и печатать её на экран.
*/