#include <stdio.h>

/*
    Здравствуйте, это первый файл семестра по языку C++  (для тех, кто знаком с языком C)

    Язык C++ создан на основе языка C и одним из приоритетов C++ является обратная совместимость с C
    Поэтому почти любая программа на языке C будет работать и на языке C++

    Однако, нужно помнить, что это разные языки. В C++ было добавлено огромное количество новых возможностей, 
    что сделало C++ возможно самым объёмным и мощным языком программирования.

    C++ содержит в себе во много раз больше всего, чем язык C и пройти его за один семестр не представляется возможным,
    но мы пройдём ключевые части этого языка.


    Для компиляции программ на C++ будем использовать компилятор g++.
    Скомпилируйте эту программу вот так:
        g++ 00hello.cpp
    
    И запустите вот так (для Windows):
        a.exe

    И запустите вот так (для Linux):
        ./a.out

*/


int main() 
{
    printf("Hello World of C++\n");
}

