#include <stdio.h>

int main()
{
    int a[10] = {1, 12, 4, 3, 8, 17, 15, 6, 14, 5};
}



/*
    Задачи
    
        Пусть у нас есть массив  a   состоящий из 10 элементов.
        

        1)  Напечатайте на экран каждый второй элемент массива, начиная с элемента номер 0.
            То есть для данного массива программа должна напечатать:

                1 4 8 15 14


        2)  Напечатайте на экран только чётные элементы данного массива.
            То есть для данного массива программа должна напечатать:

                12 4 8 6 14


        3)  Напечатайте массив 2 раза. Каждый раз в новой строке
            То есть для данного массива программа должна напечатать:

                1 12 4 3 8 17 15 6 14 5
                1 12 4 3 8 17 15 6 14 5


        4)  Напечатайте массив, при этом печатая каждый элемент по 2 раза
            То есть для данного массива программа должна напечатать:

                1 1 12 12 4 4 3 3 8 8 17 17 15 15 6 6 14 14 5 5


        5)  Напечатайте массив наоборот
            То есть для данного массива программа должна напечатать:

                5 14 6 15 17 8 3 4 12 1


        6)  Вычислите сумму этого массива и напечатайте
            То есть для данного массива программа должна напечатать:

                85


        7)  Напечатайте индексы и сами элементы этого массива в следующем формате
                индекс: элемент

            то есть нужно напечатать вот это:

                0: 1
                1: 12
                2: 4
                3: 3
                4: 8
                5: 17
                6: 15
                7: 6
                8: 14
                9: 5

*/
