#include <iostream>
#include <list>

using std::cout;
using std::endl;

int main()
{
    std::list<int> l;
    cout << "Size = " << l.size() << endl;

    // Добавьте в связный список элементы: 4 8 15 16 23 42
    // Используёте методы push_back и push_front
    // Ваш код:

    // Напечатайте их с помощью цикла, используя итератор
    // Ваш код:


    // Напечатайте их с помощью range-based for цикла. При компиляции используёте опцию -std=c++11
    // Ваш код:


    // Создайте новый список под названием animals, который будет содержать строки std::string. 
    // Инициализируйте его следующими значениями: {"Cow", "Cat", "Lion", "Hyppo", "Elephant"}. 
    // Используёте brace initialization
    // Напечатайте получившийся список, используя range-based for loop
    // Ваш код:


    // Отсортируйте ваш список с помощью метода sort() и напечатайте его
    // Ваш код:

    // Обратите ваш список с помощью метода reverse() и напечатайте его
    // Ваш код:    

    // Измените первую букву каждой строки на букву 'A' используя range-based for loop со ссылкой и напечатайте список
    // Ваш код:

    // Удалите 3-й элемент из вашего списка
    // Для этого нужно создать итератор, который будет указывать на 3-й элемент. 
    // Затем нужно использовать метод erase(<итератор>)

}