#include <stdio.h>

int main()
{
	// Задание 1:     ///////////////
	
	int a = 45745;

	// a) Напечатайте адрес переменной a:
	// b) Создайте переменную pointer_to_a типа int* и сохраните туда адрес a
	// c) Используйте переменную pointer_to_a, чтобы увеличить переменную a в 2 раза
	// d) Напечатайте переменную a (используйте %d), чтобы проверить, что a действительно увеличилась в 2 раза
	// /////////////////// Ваш код ниже: //////////////////////////////////////







	// //////////////////////////////////////////////////////////////////////////////////////
	// Задание 2:     ///////////////

	float b = 714.36;
	
	// a) Напечатайте адрес переменной b:
	// b) Создайте переменную pb типа float* и сохраните туда адрес b
	// c) Используйте переменную pb, чтобы возвести переменную b в квадрат
	// d) Напечатайте переменную b (%f), чтобы проверить, что b действительно возвелась в квадрат
	// /////////////////// Ваш код ниже: //////////////////////////////////////








	// //////////////////////////////////////////////////////////////////////////////////////
	// Задание 3:     ///////////////

	int* c = &a;
	
	// a) Напечатайте адрес переменной c:
	// b) Создайте переменную pc типа int** и сохраните туда адрес c
	// c) Используйте переменную pc, чтобы прибавить к переменной c число 1
	// d) Напечатайте переменную c (%p), чтобы проверить, что c действительно изменилась как надо
	// /////////////////// Ваш код ниже: //////////////////////////////////////






	// //////////////////////////////////////////////////////////////////////////////////////
	// Задание 4:     ///////////////

	struct test
	{
		char x;
		int y;
		float z;
	};
	struct test d = {'a', 531, 6.437};
	
	// a) Напечатайте размер структуры d, используйте sizeof:
	// b) Напечатайте адрес переменной d и адреса всех её полей:
	// c) Создайте переменную pd типа struct test* и сохраните туда адрес d
	// d) Используйте переменную pd, изменить поле y структуры d
	// e) Напечатайте все поля структуры d, чтобы проверить, что c она изменилась как надо
	// /////////////////// Ваш код ниже: //////////////////////////////////////






	// //////////////////////////////////////////////////////////////////////////////////////



}