#include <stdio.h>

int main()
{
	// Задание 1:     ///////////////
	
	int numbers[7] = {4, 8, 15, 16, 23, 42, 108};
	int* p = &numbers[3];

	printf("1) %d\n", numbers[5]);

	// Чему равны следующие выражения:
	// 1) numbers[5]
	// 2) *p
	// 3) *(p + 1)
	// 4) *(p - 2)
	// 5) p[0]
	// 6) p[1]
	// 7) p[-2]
	// 8) *numbers
	// 9) *(numbers+5)
	// 10) p - numbers
	// 11) (short*)p - (short*)numbers
	// 12) (char*)p - (char*)numbers
	// Проверьте ваши догадки, напечатав все эти выражения
	// /////////////////// Ваш код ниже: //////////////////////////////////////




	// Задание 2:  ////////////
	// Так как по определению квадратных скобок:    array[3] == *(array + 3)
	// То, можно проделать следующую последовательность действий:
	// array[3] = *(array + 3) = *(3 + array) = 3[array]
	// Проверьте, напечатав эти выражения для массива numbers


}