#include <stdio.h>
#include <string.h>

// Задание 1:
// Описать структуру Date, с полями: day, month и year.
// Используйте typedef, чтобы дать типу структуры имя Date, а не struct date



// Задание 2:
// Написать функцию void print_date(Date x) для печати этой структуры в формате DD.MM.YYYY



// Задание 3:
//  Описать структуру Movie с полями: 
//       title -- название фильма
//       running_time -- длительность в минутах
//       rating -- оценка на Кинопоиске
//       release_date -- дата выхода
// Используйте typedef, чтобы дать типу структуры имя Movie

// Задание 4:
// Написать функцию void print_movie(Movie x) для печати этой структуры (формат выберите сами)

int main() {
    // Задание 5:
    // Объявите переменную типа Movie и инициализируйте её следующими значениями
    //        title = Blade Runner 2049, running_time = 163, rating = 7.625, release_date = {3, 10, 2017}.
    //        напечатайте её


    // Задание 6: Отдельной командой измените месяц выхода фильма,
    //            код из задания 4 трогать не нужно
    //            Проверьте себя, напечатав переменную



    // Задание 7: Написать функцию change_rating(Movie* pm, float new_rating) и вызвать её в функции main().


    // Задание 8: Объявить и инициализировать массив фильмов, содержащий 
    /*  
        {
            {"The Godfather", 175, 8.735, {14, 3, 1972}},
            {"The Shawshank Redemption", 142, 9.112, {10, 9, 1994}},
            {"Fight Club", 175, 8.651, {10, 9, 1999}},
            {"The Matrix", 131, 8.491, {24, 3, 1999}},
            {"Pulp Fiction", 154, 8.620, {21, 5, 1994}},
            {"Citizen Kane", 119, 7.826, {1, 5, 1941}},
            {"A Clockwork Orange", 137, 7.959, {19, 12, 1971}},
            {"2001: A Space Odyssey", 149, 7.988, {2, 4, 1968}},
            {"Finding Nemo", 175, 7.862, {30, 05, 2003}},
            {"Vzlomat blogerov", 90, 1.029, {10, 11, 2016}}
        };
    */

    // Задание 9: Написать функцию, которая по массиву фильмов находит средний рейтинг 
    //             Функция должна принимать массив и количество элементов
    //             и возвращать 1 число - средний балл


    // Задание 10: Написать функцию void print_good_movies, которая должна принимать
    //             массив, кол-во элементов и число r типа float
    //             и печатать только те фильмы, чей рейтинг выше  r

    // Задание 11: Написать функцию, которая принимает на вход массив фильмов и 
    //             возвращает указатель на фильм с самым высоким рейтингом.
    //                        ^^^^^^^^^
    //             Функция должна принимать массив и количество элементов
    //             Используйте эту функцию и функцию print_movie, чтобы напечатать фильм с самым высоким рейтингом.



}
