#include "image.h"

int main()
{
    // Для компиляции: g++ main.cpp image.cpp
    
    /* Задание:
        1) Используйте написанный класс Image, чтобы считать картинку zlatoust.ppm,
            обратить её цвета и сохранить под названием "result.ppm"

        2) Используйте написанный класс Image, чтобы создать картинку размера 800x800
            и нарисовать на ней шахматную доску 8х8 и сохренить под именем chess.ppm

        3) Добавьте в класс Image функцию swap_channels(int channel1, int channel2)
            которая будет менять местами 2 канала в цветах изображения
            Например swap_channels(0, 2) - будет менять красный и синий цвета
     */
}